ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g518x/SYSCTL_1.0.xml
    <register id="SYSCTL_SHDNIOREL" width="32" offset="0x131C" description="SHUTDOWN IO release control">
        <bitfield id="RELEASE" description="Set RELEASE to release the IO after a SHUTDOWN mode exit." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Release IO"/>
        </bitfield>
    </register>
    <register id="SYSCTL_EXRSTPIN" width="32" offset="0x1320" description="Disable the reset function of the NRST pin">
        <bitfield id="DISABLE" description="Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="Reset function of NRST pin is enabled"/>
            <bitenum id="TRUE" value="0x1" description="Reset function of NRST pin is disabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSSTATUSCLR" width="32" offset="0x1324" description="Clear sticky bits of SYSSTATUS">
        <bitfield id="ALLECC" description="Set ALLECC to clear all ECC related SYSSTATUS indicators." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLEAR" value="0x1" description="Clear ECC error state"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SWDCFG" width="32" offset="0x1328" description="Disable the SWD function on the SWD pins">
        <bitfield id="DISABLE" description="Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Disable SWD function on SWD pins"/>
        </bitfield>
    </register>
    <register id="SYSCTL_FCCCMD" width="32" offset="0x132C" description="Frequency clock counter start capture">
        <bitfield id="GO" description="Set GO to start a capture with the frequency clock counter (FCC)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_USBFLLCTL" width="32" offset="0x1340" description="USB FLL Control Register">
        <bitfield id="FLLEN" description="USB Oscillator Frequeny Lock Loop Enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="USB CLK Frequeny Lock Loop is disabled"/>
            <bitenum id="TRUE" value="0x1" description="USB CLK Frequeny Lock Loop is enabled"/>
        </bitfield>
        <bitfield id="REFSEL" description="Reference Clock Selection for Frequency Lock Loop" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="LFCLK" value="0x1" description="Use LFCLK as Reference Clock"/>
        </bitfield>
        <bitfield id="CLKEN" description="USB Oscillator Enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="USB CLK is disabled"/>
            <bitenum id="TRUE" value="0x1" description="USB CLK is enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_USBFLLADJ" width="32" offset="0x1344" description="USB FLL Manual Adjustment Register">
        <bitfield id="FRQMOD" description="Frequency Lock Loop Modulator Value" begin="10" end="8" width="3" rwaccess="R/W">
        </bitfield>
        <bitfield id="FRQADJ" description="Frequency Lock Loop Adjust" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_USBFLLSTAT" width="32" offset="0x1348" description="USB FLL Status Register">
        <bitfield id="FRQMOD" description="Current Frequency Lock Loop Modulator Value" begin="26" end="24" width="3" rwaccess="R">
        </bitfield>
        <bitfield id="REFRDY" description="Reference Clock for Frequency Lock Loop ready indication" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="USB FLL Reference clock is not ready"/>
            <bitenum id="TRUE" value="0x1" description="USB FLL Reference clock is ready"/>
        </bitfield>
        <bitfield id="FLLLOCK" description="USB Oscillator Frequeny Lock Loop Lock Indication" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="USB CLK Frequeny Lock Loop is not locked"/>
            <bitenum id="TRUE" value="0x1" description="USB CLK Frequeny Lock Loop is locked"/>
        </bitfield>
        <bitfield id="CLKRDY" description="USB Oscillator Ready Indication" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="FALSE" value="0x0" description="USB CLK is not ready"/>
            <bitenum id="TRUE" value="0x1" description="USB CLK is ready"/>
        </bitfield>
        <bitfield id="FRQADJ" description="Current Frequency Lock Loop Adjust" begin="21" end="16" width="6" rwaccess="R">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE0" width="32" offset="0x1400" description="Shutdown storage memory (byte 0)">
        <bitfield id="DATA" description="Shutdown storage byte 0" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE1" width="32" offset="0x1404" description="Shutdown storage memory (byte 1)">
        <bitfield id="DATA" description="Shutdown storage byte 1" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE2" width="32" offset="0x1408" description="Shutdown storage memory (byte 2)">
        <bitfield id="DATA" description="Shutdown storage byte 2" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SHUTDNSTORE3" width="32" offset="0x140C" description="Shutdown storage memory (byte 3)">
        <bitfield id="DATA" description="Shutdown storage byte 3" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_FWEPROTMAIN" width="32" offset="0x3000" description="1 Sector Write-Erase per bit starting at address 0x0 of flash">
    </register>
